# Filtering

In [1]:
import pandas as pd
testData = pd.read_csv("./data/startdata.csv",sep = ';', index_col = ['Date and time'], parse_dates = ['Date and time'], dayfirst = True)

## Using the index

We can do some initial filtering on the index if it is a datetime: 
```python
DataFrame['2018-01-02'] 
```
gives all rows for Januari 2nd, 2018, even if there are more than one and they are from different moments during that day.

In [13]:
testData['2019-01-02']

                    Visibility  Value  Value2 Value3
Date and time
2019-01-02 00:00:00       Show     26       1      E
2019-01-02 06:00:00       Show     38      63      F
2019-01-02 12:00:00       Show     54      33      A
2019-01-02 18:00:00       Show     89      11      B

## GroupBy

If there is a column with values that can be the same, the **groupby** function can be used to combine those toghether, e.g. postal codes. Once that grouping is done an aggregate function can be performed on that grouped data:

In [5]:
testData.groupby('Value3').mean()

         Value  Value2
Value3
A       38.000  43.000
B       69.625  41.625
C       59.250  34.750
D       55.875  58.625
E       48.125  39.000
F       34.125  44.875

To see how many rows were included per group, use the **.size()** function:

In [6]:
testData.groupby('Value3').size()

Value3
A    8
B    8
C    8
D    8
E    8
F    8
dtype: int64

To perform multiple aggregations on a certain column you can use the **.agg()** function on it, with the functions you want executed passed as a list:

In [4]:
testData.groupby('Value3').agg(["min","max"])

       Visibility       Value     Value2
              min   max   min max    min max
Value3
A            Show  Show     1  86      6  91
B            Hide  Show    32  91      2  95
C            Hide  Show    18  95     12  57
D            Show  Show    30  74      8  94
E            Hide  Show     1  98      0  95
F            Show  Show     4  89      8  96

## .agg()

.agg is different from .groupby in that it can specify different operations to perform on different columns, and that it can perform multiple operations on those columns, generating multiple results per column. Often it's used in conjunction with .groupby.

In [22]:
testData.groupby('Value3').agg({'Value3':'count'})

        Value3
Value3
A            8
B            8
C            8
D            8
E            8
F            8

In [24]:
testData.groupby('Value3').agg({'Value':['min', 'max'], 'Value2' : 'mean'})

       Value      Value2
         min max    mean
Value3
A          1  86  43.000
B         32  91  41.625
C         18  95  34.750
D         30  74  58.625
E          1  98  39.000
F          4  89  44.875

## Resample

The resample function resamples the DataFrame into new buckets based on the column specified, whose size is determined by the specified interval. Then the specified operation is performed on those. Here we won't specify a column, which then uses the index, and we resample to days (D)

In [6]:
testData.resample("D").sum().head()

               Value  Value2
Date and time
2019-01-01       208     138
2019-01-02       207     108
2019-01-03       264     211
2019-01-04       252     266
2019-01-05        85      71

Various examples of the strings to be used can be found here:

http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html <br>
https://stackoverflow.com/questions/17001389/pandas-resample-documentation

The main difference between groupby and resample is that for groupby the groups can only be items allready existing in the DataFrame. Resample creates new buckets in which the rows are inserted.

An alternative way to do this (when working with datatimes), without using the resample function is to use the to_period() function on the index which is a datetime here. It alows us to specify a time period to which to change the original datetime, which can then be used for grouping.

In [4]:
testData.groupby(testData.index.to_period('D')).sum().head()

               Value  Value2
Date and time
2019-01-01       208     138
2019-01-02       207     108
2019-01-03       264     211
2019-01-04       252     266
2019-01-05        85      71

## Sorting

DataFrames also have a sorting function, alowing us to choose on which columns to sort and ascending or descending:
```python
.sort_values(['Column', 'Column2', ...], ascending=False)
```

In [10]:
testData.sort_values(['Value'], ascending=False).head(5)

                    Visibility  Value  Value2 Value3
Date and time
2019-01-03 12:00:00       Show     98      65      E
2019-01-04 12:00:00       Hide     95      39      C
2019-01-09 12:00:00       Show     93      14      E
2019-01-08 18:00:00       Hide     91      61      B
2019-01-03 00:00:00       Show     90      12      C

If we want to perform a sort on the index we can use .sort_index() to do than:

In [6]:
testData.sort_index(ascending=False).head(3)

                    Visibility  Value  Value2 Value3
Date and time
2019-01-12 18:00:00       Show     50      46      F
2019-01-12 12:00:00       Show      5      59      E
2019-01-12 06:00:00       Show     46      76      D

Next: [Row operations](06-Row_operations.ipynb) | [Content](00-Content.ipynb)